<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 19b8a9c (first)
>>>>>>> 8f5179a (first)
>>>>>>> 87a8fdf (first)
>>>>>>> 1e8021d (first)
>>>>>>> 5938de4 (first)
>>>>>>> c55f785 (first)
/**
 * Created by grovekingli on 2018/9/10.
 */
var navMessage =  [{
    "home": "图书馆",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "同仁楼",
    "deskList": [{
        "name": "I段进线变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "同德楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "同济楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
},  {
    "home": "学生活动中心",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "一期宿舍",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器"]
    }]
}, {
    "home": "二期宿舍",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器"]
    }]
}, {
    "home": "中试基地",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "学院路2#",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "求是楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "三期宿舍食堂",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器","Ⅳ段进线变压器","Ⅴ段进线变压器"]
    }]
}, {
    "home": "学院路1#",
    "deskList": [{
        "name": "变压器",
        "loop": ["1号变压器8176","2号变压器8176","3号变压器288线","4号变压器288线"]
    }]
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
=======
/**
 * Created by grovekingli on 2018/9/10.
 */
var navMessage =  [{
    "home": "图书馆",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "同仁楼",
    "deskList": [{
        "name": "I段进线变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "同德楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "同济楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
},  {
    "home": "学生活动中心",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "一期宿舍",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器"]
    }]
}, {
    "home": "二期宿舍",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器"]
    }]
}, {
    "home": "中试基地",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "学院路2#",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器"]
    }]
}, {
    "home": "求是楼",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器"]
    }]
}, {
    "home": "三期宿舍食堂",
    "deskList": [{
        "name": "变压器",
        "loop": ["Ⅰ段进线变压器", "Ⅱ段进线变压器","Ⅲ段进线变压器","Ⅳ段进线变压器","Ⅴ段进线变压器"]
    }]
}, {
    "home": "学院路1#",
    "deskList": [{
        "name": "变压器",
        "loop": ["1号变压器8176","2号变压器8176","3号变压器288线","4号变压器288线"]
    }]
>>>>>>> dedd623 (first)
>>>>>>> 19b8a9c (first)
>>>>>>> 8f5179a (first)
>>>>>>> 87a8fdf (first)
>>>>>>> 1e8021d (first)
>>>>>>> 5938de4 (first)
>>>>>>> c55f785 (first)
}];